app/views/movies/show.html.erb

  <b>Actor 1</b>
  <%= @movie.actors.first().name %>
---
SELECT "actors".* FROM "actors" WHERE "actors"."movie_id" = 1