app/views/data_io/index.html.erb

DELETE FROM "data" WHERE "data"."id" = ?  [["id", 216]]
---
      <td class="delete">
        <button class="btn btn-danger" data-type="{%=file.delete_type%}" data-url="{%=file.delete_url%}">