app/views/metadata/show.html.erb

  <table>
  	<% @metadatum.data.each do |datum| %>
---
SELECT "data".* FROM "data" WHERE "data"."metadatum_id" = 1 LIMIT 1