app/controllers/metadata_controller.rb

INSERT INTO "data" ("created_at", "metadatum_id", "param1", "param10", "param2", "param3", "param4", "param5", "param6", "param7", "param8", "param9", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def new
    #@metadatum = Metadatum.new
    d = Datum.create(:param1 => "d_test")

    @metadatum = Metadatum.create(:name => "m_test", :data => [d])