app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @movie = Movie.find(params[:id])

INSERT INTO "actors" ("created_at", "movie_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 27 Jan 2012 04:05:23 UTC +00:00], ["movie_id", nil], ["name", "Tom Hanks"], ["updated_at", Fri, 27 Jan 2012 04:05:23 UTC +00:00]]
INSERT INTO "movies" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 27 Jan 2012 04:07:01 UTC +00:00], ["name", "Toy Story"], ["updated_at", Fri, 27 Jan 2012 04:07:01 UTC +00:00]]
---
  def new
    a = Actor.create(:name => "Tom Hanks")
    #@movie = Movie.new

    @movie = Movie.create(:name => "Toy Story", :actors => [a])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @movie = Movie.find(params[:id])