app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT "pages".* FROM "pages"